; domain
; Source: https://github.com/AI-Planning/pddl-generators/tree/main/miconic
; Fix: prevent the elevator from boarding served passengers => (not (origin ?p ?f)) effect added to board action
(define (domain miconic)
  (:requirements :strips :typing)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (and (boarded ?p) (not (origin ?p ?f))))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
;; passengers=4, floors=9, out_folder=training/easy, instance_id=42, seed=69

(define (problem miconic-42)
 (:domain miconic)
 (:objects 
    p1 p2 p3 p4 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 f9 - floor
    )
 (:init 
    (lift-at f1)
    (origin p1 f2)
    (destin p1 f4)
    (origin p2 f2)
    (destin p2 f7)
    (origin p3 f6)
    (destin p3 f8)
    (origin p4 f8)
    (destin p4 f7)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f1 f9)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f2 f9)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f3 f9)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f4 f9)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f5 f9)
    (above f6 f7)
    (above f6 f8)
    (above f6 f9)
    (above f7 f8)
    (above f7 f9)
    (above f8 f9)
)
 (:goal  (and (served p1)
   (served p2)
   (served p3)
   (served p4))))

; plan
1. (up f1 f2)
   deleted: (lift-at f1)
   added: (lift-at f2)
   goals met: 0 of 4
2. (board f2 p1)
   deleted: (origin p1 f2)
   added: (boarded p1)
   goals met: 0 of 4
3. (board f2 p2)
   deleted: (origin p2 f2)
   added: (boarded p2)
   goals met: 0 of 4
4. (up f2 f4)
   deleted: (lift-at f2)
   added: (lift-at f4)
   goals met: 0 of 4
5. (depart f4 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 1 of 4
6. (up f4 f6)
   deleted: (lift-at f4)
   added: (lift-at f6)
   goals met: 1 of 4
7. (board f6 p3)
   deleted: (origin p3 f6)
   added: (boarded p3)
   goals met: 1 of 4
8. (up f6 f8)
   deleted: (lift-at f6)
   added: (lift-at f8)
   goals met: 1 of 4
9. (depart f8 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 2 of 4
10. (board f8 p4)
   deleted: (origin p4 f8)
   added: (boarded p4)
   goals met: 2 of 4
11. (down f8 f7)
   deleted: (lift-at f8)
   added: (lift-at f7)
   goals met: 2 of 4
12. (depart f7 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 3 of 4
13. (depart f7 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 4 of 4
